mistyrain83/cc3200wifi/user/wifiapp/main.c
			for(i = 0; i < iStatus; i++)
			{
				UART_PRINT("0x%x\n\r", g_cBsdRecvBuf[i]);
			}
			UART_PRINT("\n");
			

			// parse receive buf
			if((g_cBsdRecvBuf[0] == MSG_TYPE_RECV) 
				&& (g_cBsdRecvBuf[1] == MSG_VER_CONTROL4) 
				&& (iStatus >= DO_MSG_LEN_MIN))
			{
				// DO
				if(g_cBsdRecvBuf[2] == 0x20)
				{
					usLoopNum = ((g_cBsdRecvBuf[5] << 8) + g_cBsdRecvBuf[6])/100;
					g_sRedLed.loopnum = usLoopNum;
					switch(g_cBsdRecvBuf[4])
					{
						case DO_CMD_OFF:
							g_sRedLed.cmd = DO_CMD_OFF;
							if(usLoopNum > 0)
							{
								g_sRedLed.flag = TRUE;
							}
							break;
						case DO_CMD_ON:
							g_sRedLed.cmd = DO_CMD_ON;
							if(usLoopNum > 0)
							{
								g_sRedLed.flag = TRUE;
							}
							break;
						case DO_CMD_TOGGLE:
							g_sRedLed.cmd = DO_CMD_TOGGLE;
							if(usLoopNum > 0)
							{
								g_sRedLed.flag = TRUE;
							}
							break;
						default:
							UART_PRINT("[WARN] DO Cmd ERROR!\n");
							break;
					}
				}
				else
				{
					UART_PRINT("[WARN] Not DO Device!\n");
				}
			}
			else
			{
				UART_PRINT("Received Type or Version or msg len error!\n");
			}

			osi_Sleep(3000);
		}
    }	

}

static void TcpTask(void *pvParameters)
{
  int             iCounter;
  int             iStatus;
	short           sTestBufLen = 0;
	UART_PRINT("in socket task\n");
	// filling the buffer
    for (iCounter=0 ; iCounter<BUF_SIZE ; iCounter++)
    {
        g_cBsdBuf[iCounter] = (char)(iCounter);
    }
	
    //Handle Async Events
    while(1)
    {
		g_cBsdBuf[0] = 0x10;
		g_cBsdBuf[1] = 0x01;
		g_cBsdBuf[2] = 0x20;
		g_cBsdBuf[3] = 0x01;
		g_cBsdBuf[4] = GPIO_IF_LedStatus(MCU_RED_LED_GPIO);
		g_cBsdBuf[5] = 0x00;
		sTestBufLen = 6;
        // sending packet
        iStatus = sl_Send(g_iTcpSocketID, g_cBsdBuf, sTestBufLen, 0 );
        if( iStatus <= 0 )
        {
          sl_Close(g_iTcpSocketID);
            // error
          ERR_PRINT(iStatus);
		  LOOP_FOREVER();
        }
		osi_Sleep(3000);
    }
}


//****************************************************************************
//
//!    \brief LED Task - Process LED Status
//! \param[in]                  pvParameters is the data passed to the Task
//!
//! \return                        None
//
//****************************************************************************
static void LEDTask(void *pvParameters)
{
    //Handle Async Events
    while(1)
    {
		switch(g_sRedLed.cmd)
		{
			case DO_CMD_OFF:
				GPIO_IF_LedOff(MCU_RED_LED_GPIO);
				break;
			case DO_CMD_ON:
				GPIO_IF_LedOn(MCU_RED_LED_GPIO);
				break;
			case DO_CMD_TOGGLE:
				GPIO_IF_LedToggle(MCU_RED_LED_GPIO);
				break;
			default:
				break;
			
		}
		if(g_sRedLed.flag == TRUE)
		{
			g_sRedLed.loopnum--;
			if(g_sRedLed.loopnum == 0)
			{
				g_sRedLed.flag = FALSE;
				GPIO_IF_LedToggle(MCU_RED_LED_GPIO);
				g_sRedLed.cmd = DO_CMD_DEFAULT;
			}
		}
		/*
        //LED Actions
        if(g_ucLEDStatus == LED_ON)
        {
            GPIO_IF_LedOn(MCU_RED_LED_GPIO);
            osi_Sleep(500);
        }
        if(g_ucLEDStatus == LED_OFF)
        {
            GPIO_IF_LedOff(MCU_RED_LED_GPIO);
            osi_Sleep(500);
        }
        if(g_ucLEDStatus==LED_BLINK)
        {
            GPIO_IF_LedOn(MCU_RED_LED_GPIO);
            osi_Sleep(500);
            GPIO_IF_LedOff(MCU_RED_LED_GPIO);
            osi_Sleep(500);
        }
        */
		osi_Sleep(100);
    }
}

void SwIntHandler(void)
{
  MAP_GPIOIntClear(GPIOA2_BASE, 0x40);
  UART_PRINT("sw2 pressed\n");
}

//*****************************************************************************
//
//! Application startup display on UART
//!
//! \param  none
//!
//! \return none
//!
//*****************************************************************************
static void
DisplayBanner(char * AppName)
{
    UART_PRINT("\n\n\n\r");
    UART_PRINT("\t\t *************************************************\n\r");
    UART_PRINT("\t\t     CC3200 %s Application       \n\r", AppName);
    UART_PRINT("\t\t *************************************************\n\r");
    UART_PRINT("\n\n\n\r");
}

//*****************************************************************************
//
//! Board Initialization & Configuration
//!
//! \param  None
//!
//! \return None
//
//*****************************************************************************
static void
BoardInit(void)
{
/* In case of TI-RTOS vector table is initialize by OS itself */
#ifndef USE_TIRTOS
    //
    // Set vector table base
    //
#if defined(ccs)
    MAP_IntVTableBaseSet((unsigned long)&g_pfnVectors[0]);
#endif  //ccs
#if defined(ewarm)
    MAP_IntVTableBaseSet((unsigned long)&__vector_table);
#endif  //ewarm
    
#endif  //USE_TIRTOS
    
    //
    // Enable Processor
    //
    MAP_IntMasterEnable();
    MAP_IntEnable(FAULT_SYSTICK);

    PRCMCC3200MCUInit();
}

//****************************************************************************
//                            MAIN FUNCTION
//****************************************************************************
void main()
{
    long   lRetVal = -1;


    //
    // Board Initilization
    //
    BoardInit();
    
    //
    // Configure the pinmux settings for the peripherals exercised
    //
    PinMuxConfig();

    PinConfigSet(PIN_58,PIN_STRENGTH_2MA|PIN_STRENGTH_4MA,PIN_TYPE_STD_PD);
    
    // init sw2 interrupt
    GPIO_IF_ConfigureNIntEnable(GPIOA2_BASE, 0x40, GPIO_FALLING_EDGE, SwIntHandler);

    // Initialize Global Variables
    InitializeAppVariables();
    
    //
    // UART Init
    //
    InitTerm();
    
    DisplayBanner(APP_NAME);
    
  

    //
    // LED Init
    //
    GPIO_IF_LedConfigure(LED1);
      
    //Turn Off the LEDs
    GPIO_IF_LedOff(MCU_RED_LED_GPIO);
    
    //
    // Simplelinkspawntask
    //
    lRetVal = VStartSimpleLinkSpawnTask(SPAWN_TASK_PRIORITY);
    if(lRetVal < 0)
    {
        ERR_PRINT(lRetVal);
        LOOP_FOREVER();
    } 

	
	
    
    //
    // Create OOB Task
    //
    lRetVal = osi_TaskCreate(OOBTask, (signed char*)"OOBTask", \
                                OSI_STACK_SIZE, NULL, \
                                OOB_TASK_PRIORITY, NULL );
    if(lRetVal < 0)
    {
        ERR_PRINT(lRetVal);
        LOOP_FOREVER();
    }  
    
    //
    // Create OOB Task
    //
    lRetVal = osi_TaskCreate(LEDTask, (signed char*)"LEDTask", \
                                LED_STACK_SIZE, NULL, \
                                LED_TASK_PRIORITY, NULL );

	
    //
    // Start OS Scheduler
    //
    osi_start();

    while (1)
    {

    }

}
